АлогистикТест2/src/Documents/алк_СборкаСухихПакетов/алк_СборкаСухихПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_СборкаСухихПакетов</name>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПиломатериалыПереданныеНаСушку</registerRecords>
  <registerRecords>InformationRegister.алк_ПараметрыПакетов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автозаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаПродукции</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСырье</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаСырье</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемСырье</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отходы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаОтходы</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаСырье</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.НастройкиПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.НастройкиПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетовОперативный/алк_ПараметрыПакетовОперативный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетовОперативный</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.алк_ЗаказНаПроизводство</types>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопАналитика</name>
    <type>
      <types>EnumRef.алк_ДопАналитикаПараметрыПакетовОперативный</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <resources>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Актуальность</name>
    <type>
      <types>EnumRef.алк_ОперативнаяАктуальностьПакетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_ОперативнаяАктуальностьПакетов/алк_ОперативнаяАктуальностьПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ОперативнаяАктуальностьПакетов</name>
  <enumValues>
    <name>Актуален</name>
  </enumValues>
  <enumValues>
    <name>Изменен</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/ФиксированныеДопРеквизиты/ФиксированныеДопРеквизиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФиксированныеДопРеквизиты</name>
  <enumValues>
    <name>Порода</name>
  </enumValues>
  <enumValues>
    <name>Сорт</name>
  </enumValues>
  <enumValues>
    <name>Длина</name>
  </enumValues>
  <enumValues>
    <name>Сечение</name>
  </enumValues>
  <enumValues>
    <name>Влажность</name>
  </enumValues>
  <enumValues>
    <name>Поверхность</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/КатегорииНоменклатуры/КатегорииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БезКатегории</name>
      <description>&lt;Без категории></description>
    </items>
    <items>
      <name>Карандаши</name>
      <description>Карандаши</description>
    </items>
    <items>
      <name>Кора</name>
      <description>Кора</description>
    </items>
    <items>
      <name>Окорка</name>
      <description>Окорка</description>
    </items>
    <items>
      <name>Опилки</name>
      <description>Опилки</description>
    </items>
    <items>
      <name>ОтходыПилмат</name>
      <description>Отходы производства пиломатериалов</description>
    </items>
    <items>
      <name>Пиловочник</name>
      <description>Пиловочник</description>
    </items>
    <items>
      <name>Пиломатериал</name>
      <description>Пиломатериал</description>
    </items>
    <items>
      <name>ПиломатериалСП</name>
      <description>Пиломатериал (СП)</description>
    </items>
    <items>
      <name>Шпон</name>
      <description>Шпон</description>
    </items>
    <items>
      <name>ШпонКусковой</name>
      <description>Шпон кусковой</description>
    </items>
    <items>
      <name>Щепа</name>
      <description>Щепа</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПоКлассификатору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойствХарактеристики</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатурыПоУмолчанию</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_СборкаСухихПакетов/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		СвойствоОрганизация = ПланыВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация;
		СвойствоПодразделение = ПланыВидовХарактеристик.НастройкиПользователей.ОсновноеПодразделение;
		
		СписокНастроек = Новый Массив;
		СписокНастроек.Добавить(СвойствоОрганизация);
		СписокНастроек.Добавить(СвойствоПодразделение);
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователей.Настройка,
		|	НастройкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.Пользователь = &Пользователь
		|	И НастройкиПользователей.Настройка В(&СписокНастроек)";
		Запрос.УстановитьПараметр("Пользователь", ПользователиКлиентСервер.ТекущийПользователь());
		Запрос.УстановитьПараметр("СписокНастроек", СписокНастроек);
		
		ВыборкаИзРезультатаЗапроса = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
			
			Если ВыборкаИзРезультатаЗапроса.Настройка = СвойствоОрганизация Тогда
				Организация = ВыборкаИзРезультатаЗапроса.Значение;
			КонецЕсли;
			
			Если ВыборкаИзРезультатаЗапроса.Настройка = СвойствоПодразделение Тогда
				СтруктурнаяЕдиница = ВыборкаИзРезультатаЗапроса.Значение;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Смена) Тогда
		Дата = РфпСервер.ПолучитьДатуВремяНачалоКонецСмены(Смена, ТекущаяДатаСеанса()).ДатаВремяКонцаСмены;
	Иначе
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
		
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.алк_СборкаСухихПакетов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	РфпСервер.ОтразитьПиломатериалыПереданныеНаСушку(ДополнительныеСвойства, Движения, Отказ);
	РфпСервер.ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ);
	
	//Сергеева Г.О. Оборотный регистр ++  
	РфпСервер.ОтразитьОстаткиЛесопродукции(ДополнительныеСвойства, Движения, Отказ);
	//Сергеева Г.О. Оборотный регистр --
		
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

#КонецОбласти


&НаСервере
Процедура ЗаполнитьПродукциюПоДаннымРегистра() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	алк_ПараметрыПакетовОперативный.КоличествоСостав КАК Количество,
	|	алк_ПараметрыПакетовОперативный.Объем,
	|	алк_ПараметрыПакетовОперативный.Характеристика,
	|	алк_ПараметрыПакетовОперативный.ДатаСмены,
	|	алк_ПараметрыПакетовОперативный.Смена,
	|	алк_ПараметрыПакетовОперативный.Характеристика.Владелец КАК Номенклатура,
	|	алк_ПараметрыПакетовОперативный.Сертификат,
	|	алк_ПараметрыПакетовОперативный.СерийныйНомер
	|ПОМЕСТИТЬ ВТ_ПараметрыПакетовОпертивный
	|ИЗ
	|	РегистрСведений.алк_ПараметрыПакетовОперативный КАК алк_ПараметрыПакетовОперативный
	|ГДЕ
	|	алк_ПараметрыПакетовОперативный.Смена = &Смена
	|	И алк_ПараметрыПакетовОперативный.ДатаСмены = &ДатаСмены
	|	И алк_ПараметрыПакетовОперативный.Актуальность = ЗНАЧЕНИЕ(Перечисление.алк_ОперативнаяАктуальностьПакетов.Актуален)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПараметрыПакетовОпертивный.Объем,
	|	ВТ_ПараметрыПакетовОпертивный.Характеристика,
	|	ВТ_ПараметрыПакетовОпертивный.ДатаСмены,
	|	ВТ_ПараметрыПакетовОпертивный.Смена,
	|	ВТ_ПараметрыПакетовОпертивный.Характеристика.Владелец КАК Номенклатура,
	|	ВТ_ПараметрыПакетовОпертивный.Сертификат,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Влажность, ЗНАЧЕНИЕ(Справочник.Влажность.ПустаяСсылка)) КАК Влажность,
	|	ВТ_ПараметрыПакетовОпертивный.Количество,
	|	ВТ_ПараметрыПакетовОпертивный.СерийныйНомер,
	|	алк_ПараметрыХарактеристик.Порода,
	|	алк_ПараметрыХарактеристик.Сорт,
	|	алк_ПараметрыХарактеристик.Длина,
	|	алк_ПараметрыХарактеристик.Сечение
	|ПОМЕСТИТЬ ВТ_СухиеТранспортныеПакеты
	|ИЗ
	|	ВТ_ПараметрыПакетовОпертивный КАК ВТ_ПараметрыПакетовОпертивный
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО ВТ_ПараметрыПакетовОпертивный.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Влажность.Ссылка,
	|	Влажность.Владелец
	|ПОМЕСТИТЬ ВТ_Влажность
	|ИЗ
	|	Справочник.Влажность КАК Влажность
	|ГДЕ
	|	Влажность.Наименование ПОДОБНО ""kd%""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СухиеТранспортныеПакеты.Объем,
	|	ВТ_СухиеТранспортныеПакеты.Характеристика КАК ХарактеристикаПродукции,
	|	ВТ_СухиеТранспортныеПакеты.ДатаСмены,
	|	ВТ_СухиеТранспортныеПакеты.Смена,
	|	ВТ_СухиеТранспортныеПакеты.Сертификат,
	|	ВТ_СухиеТранспортныеПакеты.Влажность,
	|	ВТ_СухиеТранспортныеПакеты.Количество,
	|	ВТ_СухиеТранспортныеПакеты.СерийныйНомер,
	|	ВТ_СухиеТранспортныеПакеты.Порода,
	|	ВТ_СухиеТранспортныеПакеты.Сорт,
	|	ВТ_СухиеТранспортныеПакеты.Длина,
	|	ВТ_СухиеТранспортныеПакеты.Сечение,
	|	ВТ_СухиеТранспортныеПакеты.Объем КАК ОбъемСырье
	|ИЗ
	|	ВТ_СухиеТранспортныеПакеты КАК ВТ_СухиеТранспортныеПакеты
	|ГДЕ
	|	ВТ_СухиеТранспортныеПакеты.Влажность В
	|			(ВЫБРАТЬ
	|				ВТ_Влажность.Ссылка
	|			ИЗ
	|				ВТ_Влажность КАК ВТ_Влажность)";	
	
	Запрос.УстановитьПараметр("Смена", Смена);
	Запрос.УстановитьПараметр("ДатаСмены", НачалоДня(Дата));
	
	ВыборкаИзРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	Пиломатериал 	= Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001"); //пиломатериал
	ПиломатериалСП 	= Справочники.Номенклатура.НайтиПоКоду("ПБ-00000012"); //пиломатериал СП
	ПиломатериалСП_Кат 	= Справочники.КатегорииНоменклатуры.НайтиПоКоду("00-000011"); //пиломатериал СП категория номенклатуры
	
	ТаблицаСвойствИЗначений = Новый ТаблицаЗначений;
	ТаблицаСвойствИЗначений.Колонки.Добавить("Свойство");
	ТаблицаСвойствИЗначений.Колонки.Добавить("Значение");
	
	пвхПорода    = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Порода);
	пвхСорт      = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сорт);
	пвхДлина     = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Длина);
	пвхСечение   = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сечение);
	пвхВлажность = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Влажность);

	Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
		
		ТаблицаСвойствИЗначений.Очистить();
		
		НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
		НоваяСтрокаСвойств.Свойство = пвхПорода;
		НоваяСтрокаСвойств.Значение = Справочники.Породы.НайтиПоНаименованию(ВыборкаИзРезультатаЗапроса.Порода,,,ПиломатериалСП_Кат);		
				
		НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
		НоваяСтрокаСвойств.Свойство = пвхДлина;
		НоваяСтрокаСвойств.Значение = Справочники.Длины.НайтиПоНаименованию(ВыборкаИзРезультатаЗапроса.Длина,,,ПиломатериалСП_Кат);		
		
		НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
		НоваяСтрокаСвойств.Свойство = пвхСечение;
		НоваяСтрокаСвойств.Значение = Справочники.РазмерСечения.НайтиПоНаименованию(ВыборкаИзРезультатаЗапроса.Сечение,,,ПиломатериалСП_Кат);
		
		
		НоваяСтрока = Продукция.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаИзРезультатаЗапроса);
		НоваяСтрока.Номенклатура 		= Пиломатериал;  
		НоваяСтрока.НоменклатураСырье 	= ПиломатериалСП;
		НоваяСтрока.ХарактеристикаСырье	= АлгоритмыСвойстваИХарактеристики.ПолучитьХарактеристикуПоПараметрам(ПиломатериалСП, ТаблицаСвойствИЗначений);
		
	КонецЦикла;  	
	
КонецПроцедуры
